of2306/buoyantSimpleFoam/buoyantCavity-updated/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 4e-06;

boundaryField
{
    frontAndBack
    {
        type            epsilonWallFunction;
        value           uniform 4e-06;
    }

    topAndBottom
    {
        type            epsilonWallFunction;
        value           uniform 4e-06;
    }

    hot
    {
        type            epsilonWallFunction;
        value           uniform 4e-06;
    }

    cold
    {
        type            epsilonWallFunction;
        value           uniform 4e-06;
    }
}


// ************************************************************************* //
